<?php
// $Id: $

/**
 * @file
 * Bulk export of strongarm objects generated by Bulk export module.
 */

/**
 * Implementation of hook_strongarm()
 */
function elms_icms_strongarm() {
  $strongarms = array();

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'accessibility_guideline_course_resource';
  $strongarm->value = '1392';
  $strongarms['accessibility_guideline_course_resource'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'accessibility_guideline_folder';
  $strongarm->value = '1392';
  $strongarms['accessibility_guideline_folder'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'accessibility_guideline_page';
  $strongarm->value = '1392';
  $strongarms['accessibility_guideline_page'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'accessible_content_guidelines_created';
  $strongarm->value = TRUE;
  $strongarms['accessible_content_guidelines_created'] = $strongarm;


  $strongarm->api_version = 1;
  $strongarm->name = 'switch_auto';
  $strongarm->value = 'Switch to auto mode';
  $strongarms['switch_auto'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'sync';
  $strongarm->value = 'Create missing UUIDs';
  $strongarms['sync'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'table';
  $strongarm->value = array(
    0 => array(
      'weight' => '0',
    ),
    1 => array(
      'weight' => '0',
    ),
  );
  $strongarms['table'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'teaser_length';
  $strongarm->value = '200';
  $strongarms['teaser_length'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'theme_chamfer_settings';
  $strongarm->value = array(
    'chamfer_borders' => 1,
    'chamfer_bgimage' => 0,
    'chamfer_top_logo' => 1,
    'chamfer_top_link' => '',
    'chamfer_bottom_logo' => 1,
    'chamfer_bottom_link' => '',
    'chamfer_color_template' => 'default',
    'chamfer_color_primary' => '000000',
    'chamfer_color_secondary' => '000000',
    'chamfer_color_header1' => '0099FF',
    'chamfer_color_header2' => '00CCFF',
    'chamfer_color_text' => '666666',
    'chamfer_color_link' => '0099FF',
    'chamfer_color_blocks' => 'E7E7E7',
    'chamfer_color_blockstyle_link' => '6D6D6D',
    'chamfer_color_blockstyle_bgcolor' => 'df5c5c',
    'chamfer_color_blockstyle_linkhover' => 'FFFFFF',
    'chamfer_color_footer_text' => 'FFFFFF',
    'chamfer_color_footer_link' => '00CCFF',
    'mission' => '',
    'default_logo' => 1,
    'logo_path' => '',
    'default_favicon' => 1,
    'favicon_path' => '',
    'primary_links' => 1,
    'secondary_links' => 1,
    'toggle_logo' => 1,
    'toggle_favicon' => 1,
    'toggle_name' => 1,
    'toggle_search' => 0,
    'toggle_slogan' => 1,
    'toggle_mission' => 0,
    'toggle_node_user_picture' => 0,
    'toggle_comment_user_picture' => 0,
    'toggle_primary_links' => 0,
    'toggle_secondary_links' => 0,
    'toggle_node_info_course' => 0,
    'toggle_node_info_folder' => 0,
    'toggle_node_info_link' => 0,
    'toggle_node_info_page' => 0,
    'toggle_node_info_referenced_page' => 0,
    'toggle_node_info_course_resource' => 0,
    'toggle_node_info_accessibility_guideline' => 0,
    'toggle_node_info_accessibility_test' => 0,
    'toggle_node_info_version' => 0,
    'logo_upload' => '',
    'favicon_upload' => '',
  );
  $strongarms['theme_chamfer_settings'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'theme_default';
  $strongarm->value = 'cube';
  $strongarms['theme_default'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'theme_settings';
  $strongarm->value = array(
    'toggle_logo' => 1,
    'toggle_name' => 1,
    'toggle_slogan' => 1,
    'toggle_mission' => 0,
    'toggle_node_user_picture' => 0,
    'toggle_comment_user_picture' => 0,
    'toggle_search' => 0,
    'toggle_favicon' => 1,
    'toggle_primary_links' => 0,
    'toggle_secondary_links' => 0,
    'toggle_node_info_accessibility_guideline' => 0,
    'toggle_node_info_accessibility_test' => 0,
    'toggle_node_info_course_resource' => 0,
    'toggle_node_info_course' => 0,
    'toggle_node_info_version' => 0,
    'toggle_node_info_folder' => 0,
    'toggle_node_info_link' => 0,
    'toggle_node_info_page' => 0,
    'toggle_node_info_referenced_page' => 0,
    'default_logo' => 1,
    'logo_path' => '',
    'logo_upload' => '',
    'default_favicon' => 1,
    'favicon_path' => '',
    'favicon_upload' => '',
  );
  $strongarms['theme_settings'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'theme_zen_settings';
  $strongarm->value = array(
    'zen_block_editing' => '1',
    'zen_breadcrumb' => 'yes',
    'zen_breadcrumb_separator' => '  ',
    'zen_breadcrumb_home' => '1',
    'zen_breadcrumb_trailing' => '1',
    'zen_breadcrumb_title' => '0',
    'zen_layout' => 'border-politics-liquid',
    'zen_rebuild_registry' => '0',
    'zen_wireframes' => '0',
    'mission' => '',
    'default_logo' => 1,
    'logo_path' => '',
    'default_favicon' => 1,
    'favicon_path' => '',
    'primary_links' => 1,
    'secondary_links' => 1,
    'toggle_logo' => 1,
    'toggle_favicon' => 1,
    'toggle_name' => 1,
    'toggle_search' => 0,
    'toggle_slogan' => 1,
    'toggle_mission' => 0,
    'toggle_node_user_picture' => 0,
    'toggle_comment_user_picture' => 0,
    'toggle_primary_links' => 0,
    'toggle_secondary_links' => 0,
    'logo_upload' => '',
    'favicon_upload' => '',
  );
  $strongarms['theme_zen_settings'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'tipsy';
  $strongarm->value = array(
    'drupal_forms' => array(
      'forms' => 0,
      'options' => array(
        'fade' => 1,
        'gravity' => 'autoWE',
        'delayIn' => '0',
        'delayOut' => '0',
        'trigger' => 'focus',
        'opacity' => '0.8',
        'offset' => '0',
      ),
    ),
    'custom_selectors' => array(
      0 => array(
        'selector' => '#regions_elms_navigation_left a, #regions_elms_navigation_left .regions_pre_block_container',
        'options' => array(
          'fade' => 0,
          'gravity' => 'w',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      1 => array(
        'selector' => '#regions_block_elms_navigation_top_1 a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'ne',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '1',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      2 => array(
        'selector' => '#regions_block_elms_navigation_top_2 li a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'e',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      3 => array(
        'selector' => '#regions_block_elms_navigation_bottom_0 a,',
        'options' => array(
          'fade' => 0,
          'gravity' => 'se',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      4 => array(
        'selector' => '#regions_block_elms_navigation_top_0 a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'nw',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      5 => array(
        'selector' => '#regions_elms_navigation_left a, #regions_elms_navigation_left .regions_pre_block_container',
        'options' => array(
          'fade' => 0,
          'gravity' => 'w',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      6 => array(
        'selector' => '#regions_block_elms_navigation_bottom_0 a,',
        'options' => array(
          'fade' => 0,
          'gravity' => 'se',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      7 => array(
        'selector' => '#regions_block_elms_navigation_top_1 a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'ne',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      8 => array(
        'selector' => '#regions_block_elms_navigation_top_0 a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'nw',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      9 => array(
        'selector' => '#regions_block_elms_navigation_top_2 li a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'e',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      10 => array(
        'selector' => '#regions_block_elms_navigation_top_2 .regions_block_title a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'ne',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      11 => array(
        'selector' => '#regions_block_elms_navigation_top_2 .regions_block_title a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'ne',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      12 => array(
        'selector' => '.advanced-help-link',
        'options' => array(
          'fade' => 0,
          'gravity' => 's',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      13 => array(
        'selector' => '.advanced-help-link',
        'options' => array(
          'fade' => 0,
          'gravity' => 's',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
    ),
  );
  $strongarms['tipsy'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_comp_accessibility_guideline';
  $strongarm->value = 'each';
  $strongarms['unique_field_comp_accessibility_guideline'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_comp_accessibility_test';
  $strongarm->value = 'each';
  $strongarms['unique_field_comp_accessibility_test'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_comp_blog';
  $strongarm->value = 'each';
  $strongarms['unique_field_comp_blog'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_comp_course';
  $strongarm->value = 'each';
  $strongarms['unique_field_comp_course'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_comp_course_event';
  $strongarm->value = 'each';
  $strongarms['unique_field_comp_course_event'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_comp_course_resource';
  $strongarm->value = 'each';
  $strongarms['unique_field_comp_course_resource'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_comp_feed_reader';
  $strongarm->value = 'each';
  $strongarms['unique_field_comp_feed_reader'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_comp_feed_user_import';
  $strongarm->value = 'each';
  $strongarms['unique_field_comp_feed_user_import'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_comp_folder';
  $strongarm->value = 'each';
  $strongarms['unique_field_comp_folder'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_comp_link';
  $strongarm->value = 'each';
  $strongarms['unique_field_comp_link'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_comp_page';
  $strongarm->value = 'each';
  $strongarms['unique_field_comp_page'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_comp_reaction';
  $strongarm->value = 'each';
  $strongarms['unique_field_comp_reaction'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
